import pandas as pd
import numpy as np
# 标签选取
# 行操作需要loc属性来完成俺标签或布尔组访问一组行和列
data = {'name': ['zzz', 'sss', 'aaa'], 'sex': ['男', '男', '女'], 'age': [220, 20, 22]}
# 定义标签
index = ['stu1', 'stu2', 'stu3']
df = pd.DataFrame(data, index=index)
print(df)
print('--------------------------------------')
print(type(df.loc['stu2']))
print(df.loc['stu2'])

# loc允许接受两个参数分别是行和列
print('----------------------------------')
print(df.loc['stu3', 'name'])
# 行和列还可以使用切片
print('******************************')
print(df.loc['stu1':'stu2', 'name'])   # 行可以使用切片但是列不可以

print('++++++++++++++++++++++++')
# 第一个参数代表行第二个参数代表列；可以不对应取值
print(df.loc[['stu1', 'stu2'], ['name', 'age']])


'''数值型索引和切片
     使用数据型索引 需要iloc属性
  直接使用索引，会优先查找的是列标签，如果找不到会报错，列没有位置索引
      可以使用iloc：行基于整数位置的按位置选择索引
'''
print('===================')
# 索引位置为2的数据
print(df.iloc[2])
'''
loc使用的是标签
iloc使用的是位置索引
   两者不能混用，比如在loc中使用位置索引，或者在iloc中使用标签索引
'''
print('-----------------------------')
# 取第一行和第三行的数据
print(df.iloc[[0, 2]])

#  #################################
print('$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$')
# 取出stu2和stu3的值
print(df.iloc[1:3])   # 位置索引不包含结束